output/dot/4.dot
digraph
{
   _01 [ label = "GETTABUP 2 0 0" ];
   _02 [ label = "GETUPVAL 3 1" ];
   _03 [ label = "MOVE 4 0" ];
   _04 [ label = "CALL 3 2 0" ];
   _05 [ label = "CALL 2 0 1" ];
   _06 [ label = "GETTABUP 2 0 1" ];
   _07 [ label = "MOVE 3 1" ];
   _08 [ label = "CALL 2 2 1" ];
   _09 [ label = "GETTABUP 2 0 0" ];
   _10 [ label = "LEN 3 1" ];
   _11 [ label = "GEI 3 1 1" ];
   _12 [ label = "JMP 1" ];
   _13 [ label = "LFALSESKIP 3" ];
   _14 [ label = "LOADTRUE 3" ];
   _15 [ label = "CALL 2 2 1" ];
   _16 [ label = "GETI 2 1 1" ];
   _17 [ label = "GETFIELD 2 2 2" ];
   _18 [ label = "GETI 2 2 1" ];
   _19 [ label = "GETFIELD 2 2 3" ];
   _20 [ label = "LOADI 3 1" ];
   _21 [ label = "MOVE 4 0" ];
   _22 [ label = "CALL 2 3 2" ];
   _23 [ label = "GETUPVAL 3 2" ];
   _24 [ label = "NEWTABLE 4 0 1" ];
   _25 [ label = "EXTRAARG 0" ];
   _26 [ label = "MOVE 5 2" ];
   _27 [ label = "SETLIST 4 1 0" ];
   _28 [ label = "MOVE 5 1" ];
   _29 [ label = "TAILCALL 3 3 0" ];
   _30 [ label = "RETURN 3 0 0" ];
   _31 [ label = "RETURN0" ];

   _01 -> _02 -> _03 -> _04 -> _05 -> _06 -> _07 -> _08 ->
      _09 -> _10 -> _11 -> _12 -> _14 -> _15 -> _16 -> _17 ->
      _18 -> _19 -> _20 -> _21 -> _22 -> _23 -> _24 -> _25 ->
      _26 -> _27 -> _28 -> _29;
   _11 -> _13 -> _15;
}
