output/mmd/4.mmd
flowchart TD
  _01["GETTABUP 2 0 0"]
  _02["GETUPVAL 3 1"]
  _03["MOVE 4 0"]
  _04["CALL 3 2 0"]
  _05["CALL 2 0 1"]
  _06["GETTABUP 2 0 1"]
  _07["MOVE 3 1"]
  _08["CALL 2 2 1"]
  _09["GETTABUP 2 0 0"]
  _10["LEN 3 1"]
  _11["GEI 3 1 1"]
  _12["JMP 1"]
  _13["LFALSESKIP 3"]
  _14["LOADTRUE 3"]
  _15["CALL 2 2 1"]
  _16["GETI 2 1 1"]
  _17["GETFIELD 2 2 2"]
  _18["GETI 2 2 1"]
  _19["GETFIELD 2 2 3"]
  _20["LOADI 3 1"]
  _21["MOVE 4 0"]
  _22["CALL 2 3 2"]
  _23["GETUPVAL 3 2"]
  _24["NEWTABLE 4 0 1"]
  _25["EXTRAARG 0"]
  _26["MOVE 5 2"]
  _27["SETLIST 4 1 0"]
  _28["MOVE 5 1"]
  _29["TAILCALL 3 3 0"]
  _30["RETURN 3 0 0"]
  _31["RETURN0"]

  _01 --> _02 --> _03 --> _04 --> _05 --> _06 --> _07 --> _08
  _08 --> _09 --> _10 --> _11 --> _12 --> _14 --> _15 --> _16
  _16 --> _17 --> _18 --> _19 --> _20 --> _21 --> _22 --> _23
  _23 --> _24 --> _25 --> _26 --> _27 --> _28 --> _29
  _11 --> _13 --> _15
